// Задача №0 На вход два целых числа. Проверяем, является первое число квадратом второго.

int a = 4;
int b = 16;

if (b == a*a){
    System.Console.WriteLine("ДА!");
}
else{
    System.Console.WriteLine("НЕТ! ОШИБКА!");     
}

//Как запрашивать у пользователя целые числа
//int number = Convert.ToInt32(Console.ReadLine());
//System.Console.WriteLine(number);
//Или
//int number = int.Parse(Console.ReadLine());
//System.Console.WriteLine(number);
